# #Из передачи “Здоровье” Аня узнала, что рекомендуется спать хотя бы A часов в сутки, но пересыпать тоже вредно и не
#  стоит спать более B часов. Сейчас Аня спит H часов в сутки. Если режим сна Ани удовлетворяет рекомендациям
# передачи “Здоровье”, выведите “Это нормально”. Если Аня спит менее A часов, выведите “Недосып”, если же более B
# часов, то выведите “Пересып”.
#
# Получаемое число A всегда меньше либо равно B.
#
# На вход программе в три строки подаются переменные в следующем порядке: A, B, H.
#
# Обратите внимание на регистр символов: вывод должен в точности соответствовать описанному в задании, т. е. если
# программа должна вывести "Пересып", выводы программы "пересып", "ПЕРЕСЫП", "ПеРеСыП" и другие не будут считаться
# верными.
#
# Это первое не самое тривиальное задание на условное выражение. В случаях, когда разбить исполнение программы на
# несколько направлений, стоит внимательно обдумать все условия, которые нужно использовать. Особое внимание стоит
# уделить строгости используемых условных операторов: различайте < и ≤; > и ≥. Для того, чтобы понимать, какой из них
#  стоит использовать, внимательно прочитайте условие задания.

# A = int(input("Введите А: "))
# B = int(input("Введите B: "))
# H = int(input("Введите H: "))
# if H < A:
#     print("Недосып")
# if H > B:
#     print("Пересып")
# if A <= H <= B:
#     print("Это нормально")


# Требуется определить, является ли данный год високосным.
#
# Напомним, что високосными годами считаются те годы, порядковый номер которых либо кратен 4, но при этом не кратен
# 100, либо кратен 400 (например, 2000-й год являлся високосным, а 2100-й будет невисокосным годом).
#
# Программа должна корректно работать на числах 1900≤n≤3000.
#
# Выведите "Високосный" в случае, если считанный год является високосным и "Обычный" в обратном случае (не забывайте
# проверять регистр выводимых программой символов).


# A = int(input())
# if A % 4 == 0 and A % 100 != 0 or A % 400 == 0:
#     print('Високосный')
# else:
#     print('Обычный')
