"""Узнав, что ДНК не является случайной строкой, только что поступившие в Институт биоинформатики студенты группы
информатиков предложили использовать алгоритм сжатия, который сжимает повторяющиеся символы в строке.

Кодирование осуществляется следующим образом: s = 'aaaabbсaa' преобразуется в 'a4b2с1a2', то есть группы одинаковых
символов исходной строки заменяются на этот символ и количество его повторений в этой позиции строки.

Напишите программу, которая считывает строку, кодирует её предложенным алгоритмом и выводит закодированную
последовательность на стандартный вывод. Кодирование должно учитывать регистр символов. """

s = str(input())
l = len(s) - 1
c = 1  # количество букв повторяющихся
t = ''
# если строка состоит из одного символа то составляем строку которая содержит данный символ и количество символов в
# строке , повторяющихся
if len(s) == 1:
    t = t + s + str(c)
# иначе идем дальше
else:
    for i in range(0, l):  # делаем цикл от 0 до конца строки(сколько символов в строке)
        # если символ в строке равен следущему от него символу, то увеличиваем нашу переменную, содержащию количество
        #  одинаковых букв на 1
        if s[i] == s[i + 1]:
            c += 1
            # если символ в строке не  равен следущему от нее символу, то составляем строку которая содержит этот
            # символ и количество. с - количество в данном случае будет равно 1
        elif s[i] != s[i + 1]:
            t = t + s[i] + str(c)
            c = 1
            # делаем цикл и пробегаем все с конца строки. и делаем тоже самое, что описано в цикле ввыше
    for j in range(l, l + 1):
        if s[-1] == s[-2]:
            t = t + s[j] + str(c)
        elif s[-1] != s[-2]:
            t = t + s[j] + str(c)
            c = 1
# выводим нашу отформатированную строку
print(t)


# таже задача, но более компактная
# genome = input()+' '
# s = 0
# n=genome[0]
# for i in genome:
#     if n!=i:
#         print(n + str(s), end = '')
#         s=0
#         n=i
#     s+=1

# for i in string:
#     if i == i in string:
#         counts = string.count(i)
#         v = i.replace(i, f"{i}{counts}")
#         print(v)
#     else:
#         continue

# s = input().lower()
# print((s.count('g')+s.count('c'))/len(s)*100)

"""
проверить является ли строка полиндромом

polindrom = input()
if polindrom==polindrom[::-1]:
    print('Yes')
else:
    print('No')

"""
