"""

Напишите программу, которая получает на вход три целых числа, по одному числу в строке, и выводит на консоль в три
строки сначала максимальное, потом минимальное, после чего оставшееся число.

На ввод могут подаваться и повторяющиеся числа.
"""

a = int(input())
b = int(input())
c = int(input())
maximum = max(a, b, c)  # получаем максимальное значение
minimum = min(a, b, c)  # получаем минимальное значение

print(maximum, minimum, (a + b + c) - (maximum + minimum), sep="\n")
