"""Жители страны Малевии часто экспериментируют с планировкой комнат. Комнаты бывают треугольные, прямоугольные и
круглые. Чтобы быстро вычислять жилплощадь, требуется написать программу, на вход которой подаётся тип фигуры комнаты
и соответствующие параметры, которая бы выводила площадь получившейся комнаты. Для числа π в стране Малевии
используют значение 3.14. """
from math import sqrt

figura = input()
if figura.__eq__("треугольник"):
    a = int(input())
    b = int(input())
    c = int(input())
    p = (a + b + c) / 2  # полупериметр
    S = sqrt(p * (p - a) * (p - b) * (p - c))
    print(S)
elif figura.__eq__("прямоугольник"):
    a = int(input())
    b = int(input())
    print(float(a * b))
else:
    r = int(input())
    print(float(3.14 * pow(r, 2)))
