"""

Напишите программу, которая выводит часть последовательности 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5 ... (число повторяется
столько раз, чему равно). На вход программе передаётся неотрицательное целое число n — столько элементов
последовательности должна отобразить программа. На выходе ожидается последовательность чисел, записанных через пробел
в одну строку.

Например, если n = 7, то программа должна вывести 1 2 2 3 3 3 4.

Sample Input:

7
Sample Output:

1 2 2 3 3 3 4

"""

n = int(input())
x = range(n + 1)
final = []
# Функция enumerate применяется в случаях, когда необходим счётчик количества элементов в последовательности.
# Позволяет избавиться от необходимости инициализировать и обновлять отдельную переменную-счётчик:
# пробегаем по всем элементам списка и получаем их индекс
for index, item in enumerate(x):
    # Расширяет список final, добавляя в конец все элементы диапозона x
    # помещенные значения в список final, повторяются столько раз, чему равны
    final.extend([x[index]] * item)
# Выводим срез списка(т.е диапозон от 0 до n) и помещаем в строку print(" ".join(str(i) for i in final[0:n]))
# применяем список, как отдельный аргумент: и пусть print()позаботится о преобразовании каждого элемента в строку. Вы
#  можете, как всегда, управлять разделителем, задав sep= аргумент ключевого слова: Если вам не нужна объединенная
# строка для чего-то другого, это самый простой способ. В противном случае используйте str.join():
# Обратите внимание, что для этого требуется ручное преобразование в строки для любых нестроковых значений L!
print(*final[0:n])
