"""

Напишите программу, которая считывает список чисел lst из первой строки и число x из второй строки, которая выводит
все позиции, на которых встречается число x в переданном списке lst.

Позиции нумеруются с нуля, если число x не встречается в списке, вывести строку "Отсутствует" (без кавычек,
с большой буквы).

Позиции должны быть выведены в одну строку, по возрастанию абсолютного значения.

Sample Input 1:

5 8 2 7 8 8 2 4
8
Sample Output 1:

1 4 5

"""

lst = [int(i) for i in input().split()]
x = int(input())
# смотрим список на присутсвие значения введенного пользователем, если его нет, то выводим Отсутствует
# иначе пробегаем по всему списку и выводим позиции(индексы), на которых стоит число введенное пользователем
if x not in lst:
    print("Отсутствует")
for index, item in enumerate(lst):
    if item == x:
        print(index, end=" ")
