"""

Выведите таблицу размером n×n, заполненную числами от 1 до n2 по спирали, выходящей из левого верхнего угла и
закрученной по часовой стрелке, как показано в примере (здесь n=5):
﻿
Sample Input:

5
Sample Output:

1 2 3 4 5
16 17 18 19 6
15 24 25 20 7
14 23 22 21 8
13 12 11 10 9

"""


def spiral(n):
    dx, dy = 1, 0  # текущее значение для заполнения ячейки, порядковый номер контура
    x, y = 0, 0  # строки , столбцы
    # Создаем нулевую квадратную матрицу заданной размерности
    array = [[None] * n for j in range(n)]
    # начинаем заполнять нашу матрицу значениями
    for i in range(1, n ** 2 + 1):
        array[x][y] = i  # заполняем ячейку(0;0)
        nx, ny = x + dx, y + dy  # высчитываем следующую ячейку
        # Если следущий номер строки и столбца больше 0, но меньше текущего номера строки и столбца,
        #  и ячейка по этому адресу пустая, то это наше следущая ячейка, которую следует заполнить
        if 0 <= nx < n and 0 <= ny < n and array[nx][ny] is None:
            x, y = nx, ny
            # иначе мы заполняем зеркальный элемент матрицы
        else:
            dx, dy = -dy, dx
            x, y = x + dx, y + dy
    return array


# выводим нашу матрицу на печать
def printspiral(array):
    n = range(len(array))
    for y in n:
        for x in n:
            print(array[x][y], end=' ')
        print()


n = int(input())
printspiral(spiral(n))
