# Приведите к целому типу число 2.99

# a: float = 2.99
# b = int(a)

# Приведите к целому типу число -1.6
#
# Заметьте, что приведение к целому типу вещественного числа соответствует отбрасыванию дробной составляющей,
# что соответствует округлению в сторону 0.
# a: float = -1.6
# b = int(a)
# print(b)


# Вычислите в python значение выражения
# 9**19 - int(float(9**19))
# print(9**19 - int(float(9**19)))

print(type(34))
