# бинарные операторы умножение, деление, сложение, вычитание, возведение в степень являются бинарными,т.е имеют два
# операнда левый и правый выдаст ошибку т.к на ноль нельзя делить print(42//(4+2*(-2))) a = 2//1  // целочастное
# деление. результат целое число / результат значение с плавающей запятой print(2//1) ответ 2 print(2/1) ответ 2.0
# возведение в степень ** a = 2014 print(a**14)


# унарные операторы это те, где участыуюет только один опранд. например взятие числа с противоположным знаком

# print(+-+43)
# f = pow(2**10, 2**50)
# print(f)

# print(123e-2) эквивалетно записи 123*10^-2 ( e-экспонента)

# print(7//3)
# идентчные записи. возведение в степень
# b = pow(2014.0, 14)
# g = 2014.0**14
# print(g)
# print(b)
