input('input data')  # выводит приглашение. после чего управление передается юзеру

# s = input()  # записать в переменную пользовательский ввод с клавиатуры

# a = int(input())  # прочитать строку с клавы и преобразовать в число

# print(s, a)  # вывод  через пробел

# Тимофей обычно спит ночью X часов и устраивает себе днем тихий час на Y минут. Определите, сколько всего минут
# Тимофей спит в сутки.
# X = int(input())
# Y = int(input())
# print(X*60 + Y)


# Коля каждый день ложится спать ровно в полночь и недавно узнал, что оптимальное время для его сна составляет X
# минут. Коля хочет поставить себе будильник так, чтобы он прозвенел ровно через X минут после полуночи, однако для
# этого необходимо указать время сигнала в формате часы, минуты. Помогите Коле определить, на какое время завести
# будильник.
#
# Часы и минуты в выводе программы должны располагаться на разных строках (см. пример работы программы)
#
# Помните, что для считывания данных нужно вызывать функцию input без аргументов!
# a = int(input())
# result1 = int(a) // 60
# result2 = int(a) % 60
# print(result1)
# print(result2)


# Катя узнала, что ей для сна надо X минут. В отличие от Коли, Катя ложится спать после полуночи в H часов и M минут.
#  Помогите Кате определить, на какое время ей поставить будильник, чтобы он прозвенел ровно через X минут после
# того, как она ляжет спать.
#
# На стандартный ввод, каждое в своей строке, подаются значения X, H и M. Гарантируется, что Катя должна проснуться в
#  тот же день, что и заснуть. Программа должна выводить время, на которое нужно поставить будильник: в первой строке
#  часы, во второй — минуты.

# X= int(input())
# H= int(input())
# M= int(input())
# print(((H*60)+X+M)//60)
# print((X+M)%60)

# # таже задача . но решение в две строки
# a,b,c=(int(input()) for i in range(3))
# print('%s\n%s' % ((a+c)//60+b, (a+c)%60))
