"""

Напишите программу, которая считывает из файла строку, соответствующую тексту, сжатому с помощью кодирования
повторов, и производит обратную операцию, получая исходный текст.

Запишите полученный текст в файл и прикрепите его, как ответ на это задание.

В исходном тексте не встречаются цифры, так что код однозначно интерпретируем.

Примечание. Это первое задание типа Dataset Quiz. В таких заданиях после нажатия "Start Quiz" у вас появляется ссылка
"download your dataset". Используйте эту ссылку для того, чтобы загрузить файл со входными данными к себе на
компьютер. Запустите вашу программу, используя этот файл в качестве входных данных. Выходной файл, который при этом у
вас получится, надо отправить в качестве ответа на эту задачу.

Sample Input:

a3b4c2e10b1
Sample Output:

aaabbbbcceeeeeeeeeeb
"""

with open("dataset_3363_2.txt", "r") as f:
    r = f.read().strip()
    print(r)
    l = len(r) - 2
    t = ''
    for i in range(0, l):
        if r[i + 1].isdigit() and r[i + 2].isdigit():
            t = t + r[i] * int(r[i + 1] + r[i + 2])
        elif r[i].isalpha():
            t = t + r[i] * int(r[i + 1])
    print(t)

# # таже программа , но с регуляркой
# import re
#
# with open("dataset_3363_2.txt", "r") as f:
#     r = f.read().strip()
# numerals = re.findall("\d+", r)
# letters = re.findall("\D+", r)
# for i in range(len(letters)):
#     print("".join(letters[i] * int(numerals[i])), end="")
